---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.Description
source: html/d0fd2d4b-9b05-7c57-5918-81ab3140ad96.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.Description Property

The description for the service

## Syntax (C#)
```csharp
public string Description { get; }
```